bradhawkins85/ESP32-Uptime-Monitoring/src/main.cpp
      // If direct lookup fails, try full service discovery and look for our service
      std::map<std::string, BLERemoteService*>* services = meshClient->getServices();
      if (services != nullptr && !services->empty()) {
        Serial.printf("Service discovery attempt %d: found %d service(s):\n", retry + 1, services->size());
        for (auto& svc : *services) {
          Serial.printf("  - Service UUID: %s\n", svc.first.c_str());
          // Check if this matches our target service UUID
          if (BLEUUID(svc.first).equals(BLEUUID(MESHCORE_SERVICE_UUID))) {
            service = svc.second;
            Serial.println("  ^ Found matching MeshCore service!");
            break;
          }
        }
        if (service != nullptr) {
          break;
        }
      } else {
        Serial.printf("Service discovery attempt %d: no services found yet\n", retry + 1);
      }
      
      if (retry < BLE_SERVICE_DISCOVERY_RETRIES - 1) {
        Serial.printf("Retrying service discovery in %d ms...\n", BLE_SERVICE_DISCOVERY_RETRY_DELAY_MS);
        delay(BLE_SERVICE_DISCOVERY_RETRY_DELAY_MS);
      }
    }
    if (service == nullptr) {
      // Print all discovered services for debugging
      std::map<std::string, BLERemoteService*>* services = meshClient->getServices();
      if (services != nullptr && !services->empty()) {
        Serial.println("Available services on peer (MeshCore service not among them):");
        for (auto& svc : *services) {
          Serial.printf("  - %s\n", svc.first.c_str());
        }
      }
      lastMeshError = "MeshCore service not found on peer";
      Serial.println("MeshCore service not found on peer, disconnecting...");
      meshClient->disconnect();
      continue;
    }

    BLERemoteCharacteristic* characteristic = service->getCharacteristic(MESHCORE_MESSAGE_CHAR_UUID);
    if (characteristic == nullptr) {
      lastMeshError = "MeshCore message characteristic missing";
      Serial.println("MeshCore message characteristic missing, disconnecting...");
      meshClient->disconnect();
      continue;
    }

    if (!characteristic->canWrite()) {
      lastMeshError = "MeshCore message characteristic is not writable";
      Serial.println("MeshCore message characteristic is not writable, disconnecting...");
      meshClient->disconnect();
      continue;
    }

    meshMessageCharacteristic = characteristic;
    meshDeviceConnected = true;
    lastMeshError = "";
    Serial.println("Connected to MeshCore peer and ready to send messages");

    if (!ensureMeshChannel()) {
      Serial.println("ensureMeshChannel() failed, disconnecting...");
      meshClient->disconnect();
      meshDeviceConnected = false;
      return false;
    }

    return true;
  }

  // Free scan results so the BLE stack can reuse memory on the next attempt
  scan->clearResults();

  lastMeshError = "MeshCore peer not found during scan";
  Serial.println(lastMeshError.c_str());
  return false;
}
void disconnectFromMeshCore() {
  // Clean up the BLE client properly before deinit
  if (meshClient != nullptr) {
    if (meshClient->isConnected()) {
      Serial.println("Disconnecting from MeshCore...");
      meshClient->disconnect();
    }
    // Delete the client to properly deregister it from BLE stack
    delete meshClient;
    meshClient = nullptr;
  }
  
  meshDeviceConnected = false;
  meshMessageCharacteristic = nullptr;
  meshChannelReady = false;
  
  // Only deinitialize BLE if it was initialized
  if (bleInitialized) {
    delay(BLE_DEINIT_CLEANUP_DELAY_MS);
    BLEDevice::deinit();
    bleInitialized = false;
    Serial.println("BLE deinitialized");
  }
}

void disconnectWiFi() {
  Serial.println("Disconnecting WiFi for BLE operation...");
  WiFi.disconnect(true);
  WiFi.mode(WIFI_OFF);
  delay(100); // Allow WiFi to fully shut down
  Serial.println("WiFi disconnected");
}

void reconnectWiFi() {
  Serial.println("Reconnecting WiFi after BLE operation...");
  WiFi.mode(WIFI_STA);
  WiFi.begin(WIFI_SSID, WIFI_PASSWORD);

  int attempts = 0;
  while (WiFi.status() != WL_CONNECTED && attempts < 30) {
    delay(1000);
    Serial.print(".");
    attempts++;
  }

  if (WiFi.status() == WL_CONNECTED) {
    Serial.println("\nWiFi reconnected!");
    Serial.print("IP address: ");
    Serial.println(WiFi.localIP());
  } else {
    Serial.println("\nFailed to reconnect to WiFi!");
  }
}

bool ensureMeshChannel() {
  if (meshChannelReady) {
    return true;
  }

  if (!meshDeviceConnected || meshMessageCharacteristic == nullptr) {
    return false;
  }

  if (!provisionMeshChannel()) {
    lastMeshError = "Mesh channel provisioning failed";
    return false;
  }

  meshChannelReady = true;
  return true;
}

bool provisionMeshChannel() {
  if (strlen(BLE_MESH_CHANNEL_NAME) == 0) {
    lastMeshError = "Mesh channel name missing";
    return false;
  }

  JsonDocument doc;
  doc["action"] = "ensure_channel";
  doc["channel"] = BLE_MESH_CHANNEL_NAME;
  doc["key"] = BLE_MESH_CHANNEL_KEY;

  String payload;
  serializeJson(doc, payload);

  Serial.printf("Provisioning MeshCore channel '%s'...\n", BLE_MESH_CHANNEL_NAME);
  try {
    meshMessageCharacteristic->writeValue(
      const_cast<uint8_t*>(reinterpret_cast<const uint8_t*>(payload.c_str())),
      payload.length(),
      false
    );
  } catch (...) {
    lastMeshError = "Failed to provision MeshCore channel";
    return false;
  }

  lastMeshError = "";

  return true;
}

void initWebServer() {

  server.on("/", HTTP_GET, [](AsyncWebServerRequest *request) {
    if (!ensureAuthenticated(request)) {
      return;
    }
    request->send(200, "text/html", getWebPage());
  });

  server.on("/api/mesh/status", HTTP_GET, [](AsyncWebServerRequest *request) {
    JsonDocument doc;
    doc["connected"] = meshDeviceConnected;
    doc["peerName"] = BLE_PEER_NAME;
    doc["deviceName"] = BLE_DEVICE_NAME;
    doc["channel"] = BLE_MESH_CHANNEL_NAME;
    doc["channelReady"] = meshChannelReady;
    doc["lastError"] = lastMeshError;
    doc["bleOperationInProgress"] = bleOperationInProgress;
    doc["monitoringPaused"] = monitoringPaused;

    String response;
    serializeJson(doc, response);
    request->send(200, "application/json", response);
  });

  server.on("/api/mesh/send", HTTP_POST, [](AsyncWebServerRequest *request) {}, NULL,
    [](AsyncWebServerRequest *request, uint8_t *data, size_t len, size_t index, size_t total) {
      if (!ensureAuthenticated(request)) {
        return;
      }

